wyp19960729/FM33L0XX-keil-GCC-/keil project/Drivers/fm33l0xx_gptim.h
#define	GPTIMx_SMCR_MSM_Pos	7	/* 主/从模式 (Master Slave Mode) */
#define	GPTIMx_SMCR_MSM_Msk	(0x1U << GPTIMx_SMCR_MSM_Pos)
#define	GPTIMx_SMCR_MSM_NONE	(0x0U << GPTIMx_SMCR_MSM_Pos)	/* 0：无动作 */
#define	GPTIMx_SMCR_MSM_DELAY	(0x1U << GPTIMx_SMCR_MSM_Pos)	/* 1：TRGI触发的动作被延迟，以使当前定时器与其从定时器实现完美同步（通过TRGO）。此设置适用于单个外部事件对多个定时器进行同步的情况 */

#define	GPTIMx_SMCR_TS_Pos	4	/* 触发选择，用于选择同步计数器的触发源 (Trigger Source) */
#define	GPTIMx_SMCR_TS_Msk	(0x7U << GPTIMx_SMCR_TS_Pos)
#define	GPTIMx_SMCR_TS_ITR0	(0x0U << GPTIMx_SMCR_TS_Pos)	/* 000：内部触发信号（ITR0） */
#define	GPTIMx_SMCR_TS_ITR1	(0x1U << GPTIMx_SMCR_TS_Pos)	/* 001：内部触发信号（ITR1） */
#define	GPTIMx_SMCR_TS_ITR2	(0x2U << GPTIMx_SMCR_TS_Pos)	/* 010：内部触发信号（ITR2） */
#define	GPTIMx_SMCR_TS_ITR3	(0x3U << GPTIMx_SMCR_TS_Pos)	/* 011：内部触发信号（ITR3） */
#define	GPTIMx_SMCR_TS_TI1F_ED	(0x4U << GPTIMx_SMCR_TS_Pos)	/* 100：TI1边沿检测（TI1F_ED） */
#define	GPTIMx_SMCR_TS_TI1FP1	(0x5U << GPTIMx_SMCR_TS_Pos)	/* 101：滤波后TI1（TI1FP1） */
#define	GPTIMx_SMCR_TS_TI2FP2	(0x6U << GPTIMx_SMCR_TS_Pos)	/* 110：滤波后TI2（TI2FP2） */
#define	GPTIMx_SMCR_TS_ETRF	(0x7U << GPTIMx_SMCR_TS_Pos)	/* 111：外部触发输入（ETRF） */

#define	GPTIMx_SMCR_SMS_Pos	0	/* 从机模式选择 (Slave Mode Selection) */
#define	GPTIMx_SMCR_SMS_Msk	(0x7U << GPTIMx_SMCR_SMS_Pos)
#define	GPTIMx_SMCR_SMS_SLAVE_DIS	(0x0U << GPTIMx_SMCR_SMS_Pos)	/* 000：从机模式禁止；CEN使能后预分频电路时钟源来自内部时钟 */
#define	GPTIMx_SMCR_SMS_ENCODER1	(0x1U << GPTIMx_SMCR_SMS_Pos)	/* 001：Encoder模式1；计数器使用TI2FP1边沿，根据TI1FP2电平高低来计数 */
#define	GPTIMx_SMCR_SMS_ENCODER2	(0x2U << GPTIMx_SMCR_SMS_Pos)	/* 010：Encoder模式2；计数器使用TI1FP2边沿，根据TI2FP1电平高低来计数 */
#define	GPTIMx_SMCR_SMS_ENCODER3	(0x3U << GPTIMx_SMCR_SMS_Pos)	/* 011：Encoder模式3；计数器同时使用TI1FP1和TI2FP2边沿，根据其他输入信号电平来计数 */
#define	GPTIMx_SMCR_SMS_RESET	(0x4U << GPTIMx_SMCR_SMS_Pos)	/* 100：复位模式；TRGI上升沿初始化计数器，并触发寄存器update */
#define	GPTIMx_SMCR_SMS_GATE	(0x5U << GPTIMx_SMCR_SMS_Pos)	/* 101：闸门模式；TRGI为高电平时，计数时钟使能，TRGI为低电平时，计数时钟停止 */
#define	GPTIMx_SMCR_SMS_TIGGER	(0x6U << GPTIMx_SMCR_SMS_Pos)	/* 110：触发模式；TRGI上升沿触发计数器开始计数（不会复位计数器） */
#define	GPTIMx_SMCR_SMS_EXCLK	(0x7U << GPTIMx_SMCR_SMS_Pos)	/* 111：外部时钟模式1；TRGI上升沿直接驱动计数器 */

#define	GPTIMx_DIER_CC4BURSTEN_Pos	19	/* 捕捉比较通道4的DMA模式配置 (CC4 Burst Enable) */
#define	GPTIMx_DIER_CC4BURSTEN_Msk	(0x1U << GPTIMx_DIER_CC4BURSTEN_Pos)
#define	GPTIMx_DIER_CC4BURSTEN_SINGLE	(0x0U << GPTIMx_DIER_CC4BURSTEN_Pos)	/* 0：Single模式，仅访问CCR */
#define	GPTIMx_DIER_CC4BURSTEN_BURST	(0x1U << GPTIMx_DIER_CC4BURSTEN_Pos)	/* 1：Burst模式，通过DCR配置访问的地址和长度 */

#define	GPTIMx_DIER_CC3BURSTEN_Pos	18	/* 捕捉比较通道3的DMA模式配置 (CC3 Burst Enable) */
#define	GPTIMx_DIER_CC3BURSTEN_Msk	(0x1U << GPTIMx_DIER_CC3BURSTEN_Pos)
#define	GPTIMx_DIER_CC3BURSTEN_SINGLE	(0x0U << GPTIMx_DIER_CC3BURSTEN_Pos)	/* 0：Single模式，仅访问CCR */
#define	GPTIMx_DIER_CC3BURSTEN_BURST	(0x1U << GPTIMx_DIER_CC3BURSTEN_Pos)	/* 1：Burst模式，通过DCR配置访问的地址和长度 */

#define	GPTIMx_DIER_CC2BURSTEN_Pos	17	/* 捕捉比较通道2的DMA模式配置 (CC2 Burst Enable) */
#define	GPTIMx_DIER_CC2BURSTEN_Msk	(0x1U << GPTIMx_DIER_CC2BURSTEN_Pos)
#define	GPTIMx_DIER_CC2BURSTEN_SINGLE	(0x0U << GPTIMx_DIER_CC2BURSTEN_Pos)	/* 0：Single模式，仅访问CCR */
#define	GPTIMx_DIER_CC2BURSTEN_BURST	(0x1U << GPTIMx_DIER_CC2BURSTEN_Pos)	/* 1：Burst模式，通过DCR配置访问的地址和长度 */

#define	GPTIMx_DIER_CC1BURSTEN_Pos	16	/* 捕捉比较通道1的DMA模式配置 (CC1 Burst Enable) */
#define	GPTIMx_DIER_CC1BURSTEN_Msk	(0x1U << GPTIMx_DIER_CC1BURSTEN_Pos)
#define	GPTIMx_DIER_CC1BURSTEN_SINGLE	(0x0U << GPTIMx_DIER_CC1BURSTEN_Pos)	/* 0：Single模式，仅访问CCR */
#define	GPTIMx_DIER_CC1BURSTEN_BURST	(0x1U << GPTIMx_DIER_CC1BURSTEN_Pos)	/* 1：Burst模式，通过DCR配置访问的地址和长度 */

#define	GPTIMx_DIER_TDE_Pos	14	/* 外部触发DMA请求使能 (Triggered DMA Enable) */
#define	GPTIMx_DIER_TDE_Msk	(0x1U << GPTIMx_DIER_TDE_Pos)
	/* 0：从机模式下，禁止外部触发事件产生DMA请求 */
	/* 1：从机模式下，允许外部触发事件产生DMA请求（可用于自动更新preload寄存器） */

#define	GPTIMx_DIER_CC4DE_Pos	12	/* 捕捉比较通道4的DMA请求使能 (CC4 DMA Enable) */
#define	GPTIMx_DIER_CC4DE_Msk	(0x1U << GPTIMx_DIER_CC4DE_Pos)
	/* 0：禁止CC4 DMA请求 */
	/* 1：允许CC4 DMA请求 */

#define	GPTIMx_DIER_CC3DE_Pos	11	/* 捕捉比较通道3的DMA请求使能 (CC3 DMA Enable) */
#define	GPTIMx_DIER_CC3DE_Msk	(0x1U << GPTIMx_DIER_CC3DE_Pos)
	/* 0：禁止CC3 DMA请求 */
	/* 1：允许CC3 DMA请求 */

#define	GPTIMx_DIER_CC2DE_Pos	10	/* 捕捉比较通道2的DMA请求使能 (CC2 DMA Enable) */
#define	GPTIMx_DIER_CC2DE_Msk	(0x1U << GPTIMx_DIER_CC2DE_Pos)
	/* 0：禁止CC2 DMA请求 */
	/* 1：允许CC2 DMA请求 */

#define	GPTIMx_DIER_CC1DE_Pos	9	/* 捕捉比较通道1的DMA请求使能 (CC1 DMA Enable) */
#define	GPTIMx_DIER_CC1DE_Msk	(0x1U << GPTIMx_DIER_CC1DE_Pos)
	/* 0：禁止CC1 DMA请求 */
	/* 1：允许CC1 DMA请求 */

#define	GPTIMx_DIER_UDE_Pos	8	/* Update Event DMA请求使能 (Update event DMA Enable) */
#define	GPTIMx_DIER_UDE_Msk	(0x1U << GPTIMx_DIER_UDE_Pos)
	/* 0：Update Event发生时，禁止产生DMA请求 */
	/* 1：Update Event发生时，允许产生DMA请求 */

#define	GPTIMx_DIER_TIE_Pos	6	/* 触发事件中断使能 (Trigger event Interrupt Enable) */
#define	GPTIMx_DIER_TIE_Msk	(0x1U << GPTIMx_DIER_TIE_Pos)
	/* 0：禁止触发事件中断 */
	/* 1：允许触发事件中断 */

#define	GPTIMx_DIER_CC4IE_Pos	4	/* 捕捉/比较通道4中断使能 (CC4 Interrupt Enable) */
#define	GPTIMx_DIER_CC4IE_Msk	(0x1U << GPTIMx_DIER_CC4IE_Pos)
	/* 0：禁止捕捉/比较4中断 */
	/* 1：允许捕捉/比较4中断 */

#define	GPTIMx_DIER_CC3IE_Pos	3	/* 捕捉/比较通道3中断使能 (CC3 Interrupt Enable) */
#define	GPTIMx_DIER_CC3IE_Msk	(0x1U << GPTIMx_DIER_CC3IE_Pos)
	/* 0：禁止捕捉/比较3中断 */
	/* 1：允许捕捉/比较3中断 */

#define	GPTIMx_DIER_CC2IE_Pos	2	/* 捕捉/比较通道2中断使能 (CC2 Interrupt Enable) */
#define	GPTIMx_DIER_CC2IE_Msk	(0x1U << GPTIMx_DIER_CC2IE_Pos)
	/* 0：禁止捕捉/比较2中断 */
	/* 1：允许捕捉/比较2中断 */

#define	GPTIMx_DIER_CC1IE_Pos	1	/* 捕捉/比较通道1中断使能 (CC1 Interrupt Enable) */
#define	GPTIMx_DIER_CC1IE_Msk	(0x1U << GPTIMx_DIER_CC1IE_Pos)
	/* 0：禁止捕捉/比较1中断 */
	/* 1：允许捕捉/比较1中断 */

#define	GPTIMx_DIER_UIE_Pos	0	/* Update事件中断使能 (Update event Interrupt Enable) */
#define	GPTIMx_DIER_UIE_Msk	(0x1U << GPTIMx_DIER_UIE_Pos)
	/* 0：禁止Update事件中断 */
	/* 1：允许Update事件中断 */

#define	GPTIMx_ISR_CC4OF_Pos	12	/* 捕捉/比较通道4的Overcapture中断 (Over-Capture Interrupt Flag for CC4) */
#define	GPTIMx_ISR_CC4OF_Msk	(0x1U << GPTIMx_ISR_CC4OF_Pos)

#define	GPTIMx_ISR_CC3OF_Pos	11	/* 捕捉/比较通道3的Overcapture中断 (Over-Capture Interrupt Flag for CC3) */
#define	GPTIMx_ISR_CC3OF_Msk	(0x1U << GPTIMx_ISR_CC3OF_Pos)

