wyp19960729/FM33L0XX-keil-GCC-/keil project/Drivers/fm33l0xx_gptim.h
#define	GPTIMx_CCMR2_OC3FE_Pos	2	/* 输出比较3快速使能 (OC3 Fast Enable) */
#define	GPTIMx_CCMR2_OC3FE_Msk	(0x1U << GPTIMx_CCMR2_OC3FE_Pos)
	/* 0：关闭快速使能，trigger输入不会影响比较输出 */
	/* 1：打开快速使能，trigger输入会立即将OC3REF改变为比较值匹配时的输出，而不管当前实际比较情况 */

#define	GPTIMx_CCMR2_CC3S_Pos	0	/* 捕捉/比较3通道选择 (CC3 channel Selection) */
#define	GPTIMx_CCMR2_CC3S_Msk	(0x3U << GPTIMx_CCMR2_CC3S_Pos)
#define	GPTIMx_CCMR2_CC3S_OUT	(0x0U << GPTIMx_CCMR2_CC3S_Pos)	/* 00：CC3通道配置为输出 */
#define	GPTIMx_CCMR2_CC3S_TI3	(0x1U << GPTIMx_CCMR2_CC3S_Pos)	/* 01：CC3通道配置为输入，IC1映射到TI3 */
#define	GPTIMx_CCMR2_CC3S_TI4	(0x2U << GPTIMx_CCMR2_CC3S_Pos)	/* 10：CC3通道配置为输入，IC1映射到TI4 */
#define	GPTIMx_CCMR2_CC3S_TRC	(0x3U << GPTIMx_CCMR2_CC3S_Pos)	/* 11：CC3通道配置为输入，IC1映射到TRC */

#define	GPTIMx_CCMR2_IC4F_Pos	12	/* 输入捕捉4滤波 (IC4 Filter) */
#define	GPTIMx_CCMR2_IC4F_Msk	(0xfU << GPTIMx_CCMR2_IC4F_Pos)


#define	GPTIMx_CCMR2_IC4PSC_Pos	10	/* 输入捕捉4预分频 (IC4 Prescaler) */
#define	GPTIMx_CCMR2_IC4PSC_Msk	(0x3U << GPTIMx_CCMR2_IC4PSC_Pos)
#define	GPTIMx_CCMR2_IC4PSC_DIV1	(0x0U << GPTIMx_CCMR2_IC4PSC_Pos)	/* 00：无分频 */
#define	GPTIMx_CCMR2_IC4PSC_DIV2	(0x1U << GPTIMx_CCMR2_IC4PSC_Pos)	/* 01：每2个事件输入产生一次捕捉 */
#define	GPTIMx_CCMR2_IC4PSC_DIV4	(0x2U << GPTIMx_CCMR2_IC4PSC_Pos)	/* 10：每4个事件输入产生一次捕捉 */
#define	GPTIMx_CCMR2_IC4PSC_DIV8	(0x3U << GPTIMx_CCMR2_IC4PSC_Pos)	/* 11：每8个事件输入产生一次捕捉 */

#define	GPTIMx_CCMR2_CC4S_Pos	8	/* 捕捉/比较4通道选择 (CC4 channel Selection) */
#define	GPTIMx_CCMR2_CC4S_Msk	(0x3U << GPTIMx_CCMR2_CC4S_Pos)
#define	GPTIMx_CCMR2_CC4S_OUT	(0x0U << GPTIMx_CCMR2_CC4S_Pos)	/* 00：CC4通道配置为输出 */
#define	GPTIMx_CCMR2_CC4S_TI4	(0x1U << GPTIMx_CCMR2_CC4S_Pos)	/* 01：CC4通道配置为输入，IC4映射到TI4 */
#define	GPTIMx_CCMR2_CC4S_TI3	(0x2U << GPTIMx_CCMR2_CC4S_Pos)	/* 10：CC4通道配置为输入，IC4映射到TI3 */
#define	GPTIMx_CCMR2_CC4S_TRC	(0x3U << GPTIMx_CCMR2_CC4S_Pos)	/* 11：CC4通道配置为输入，IC4映射到TRC */

#define	GPTIMx_CCMR2_IC3F_Pos	4	/* 输入捕捉3滤波 (IC3 Filter) */
#define	GPTIMx_CCMR2_IC3F_Msk	(0xfU << GPTIMx_CCMR2_IC3F_Pos)

#define	GPTIMx_CCMR2_IC3PSC_Pos	2	/* 输入捕捉3预分频 (IC3 Prescaler) */
#define	GPTIMx_CCMR2_IC3PSC_Msk	(0x3U << GPTIMx_CCMR2_IC3PSC_Pos)
#define	GPTIMx_CCMR2_IC3PSC_DIV1	(0x0U << GPTIMx_CCMR2_IC3PSC_Pos)	/* 00：无分频 */
#define	GPTIMx_CCMR2_IC3PSC_DIV2	(0x1U << GPTIMx_CCMR2_IC3PSC_Pos)	/* 01：每2个事件输入产生一次捕捉 */
#define	GPTIMx_CCMR2_IC3PSC_DIV4	(0x2U << GPTIMx_CCMR2_IC3PSC_Pos)	/* 10：每4个事件输入产生一次捕捉 */
#define	GPTIMx_CCMR2_IC3PSC_DIV8	(0x3U << GPTIMx_CCMR2_IC3PSC_Pos)	/* 11：每8个事件输入产生一次捕捉 */

#define	GPTIMx_CCMR2_CC3S_Pos	0	/* 捕捉/比较3通道选择 (CC3 channel Selection) */
#define	GPTIMx_CCMR2_CC3S_Msk	(0x3U << GPTIMx_CCMR2_CC3S_Pos)
#define	GPTIMx_CCMR2_CC3S_OUT	(0x0U << GPTIMx_CCMR2_CC3S_Pos)	/* 00：CC3通道配置为输出 */
#define	GPTIMx_CCMR2_CC3S_TI3	(0x1U << GPTIMx_CCMR2_CC3S_Pos)	/* 01：CC3通道配置为输入，IC1映射到TI3 */
#define	GPTIMx_CCMR2_CC3S_TI4	(0x2U << GPTIMx_CCMR2_CC3S_Pos)	/* 10：CC3通道配置为输入，IC1映射到TI4 */
#define	GPTIMx_CCMR2_CC3S_TRC	(0x3U << GPTIMx_CCMR2_CC3S_Pos)	/* 11：CC3通道配置为输入，IC1映射到TRC */

#define	GPTIMx_CCER_CC4P_Pos	13	/* 捕捉/比较4输出极性 (CC4 Polarity) */
#define	GPTIMx_CCER_CC4P_Msk	(0x1U << GPTIMx_CCER_CC4P_Pos)
#define	GPTIMx_CCER_CC4P_HIGH	(0x0U << GPTIMx_CCER_CC4P_Pos)	/* CC4通道配置为输出时：0：OC4高有效*/
#define	GPTIMx_CCER_CC4P_LOW	(0x1U << GPTIMx_CCER_CC4P_Pos)	/* 1：OC4低有效 */

#define	GPTIMx_CCER_CC4E_Pos	12	/* 捕捉/比较4输出使能 (CC4 output Enable) */
#define	GPTIMx_CCER_CC4E_Msk	(0x1U << GPTIMx_CCER_CC4E_Pos)
	/* CC4通道配置为输出时0：OC4输出关闭，OCx=0，OCx_EN=0*/
	/* 1：OCx=OCxREF+极性选择，OCx_EN=1 */

#define	GPTIMx_CCER_CC3P_Pos	9	/* 捕捉/比较3输出极性 (CC3 Polarity) */
#define	GPTIMx_CCER_CC3P_Msk	(0x1U << GPTIMx_CCER_CC3P_Pos)
#define	GPTIMx_CCER_CC3P_HIGH	(0x0U << GPTIMx_CCER_CC3P_Pos)	/* CC3通道配置为输出时：0：OC3高有效*/
#define	GPTIMx_CCER_CC3P_LOW	(0x1U << GPTIMx_CCER_CC3P_Pos)	/* 1：OC3低有效 */

#define	GPTIMx_CCER_CC3E_Pos	8	/* 捕捉/比较3输出使能 (CC3 output Enable) */
#define	GPTIMx_CCER_CC3E_Msk	(0x1U << GPTIMx_CCER_CC3E_Pos)
/* CC3通道配置为输出时0：OC3输出关闭，OCx=0，OCx_EN=0*/
/* 1：OCx=OCxREF+极性选择，OCx_EN=1 */

#define	GPTIMx_CCER_CC2P_Pos	5	/* 捕捉/比较2输出极性 (CC2 Polarity) */
#define	GPTIMx_CCER_CC2P_Msk	(0x1U << GPTIMx_CCER_CC2P_Pos)
#define	GPTIMx_CCER_CC2P_HIGH	(0x0U << GPTIMx_CCER_CC2P_Pos)	/* CC2通道配置为输出时：0：OC2高有效*/
#define	GPTIMx_CCER_CC2P_LOW	(0x1U << GPTIMx_CCER_CC2P_Pos)	/* 1：OC2低有效 */

#define	GPTIMx_CCER_CC2E_Pos	4	/* 捕捉/比较2输出使能 (CC2 output Enable) */
#define	GPTIMx_CCER_CC2E_Msk	(0x1U << GPTIMx_CCER_CC2E_Pos)
/* CC2通道配置为输出时0：OC2输出关闭，OCx=0，OCx_EN=0*/
/* 1：OCx=OCxREF+极性选择，OCx_EN=1 */

#define	GPTIMx_CCER_CC1P_Pos	1	/* 捕捉/比较1输出极性 (CC1 Polarity) */
#define	GPTIMx_CCER_CC1P_Msk	(0x1U << GPTIMx_CCER_CC1P_Pos)
#define	GPTIMx_CCER_CC1P_HIGH	(0x0U << GPTIMx_CCER_CC1P_Pos)	/* CC1通道配置为输出时：0：OC1高有效*/
#define	GPTIMx_CCER_CC1P_LOW	(0x1U << GPTIMx_CCER_CC1P_Pos)	/* 1：OC1低有效 */

#define	GPTIMx_CCER_CC1E_Pos	0	/* 捕捉/比较1输出使能 (CC1 output Enable) */
#define	GPTIMx_CCER_CC1E_Msk	(0x1U << GPTIMx_CCER_CC1E_Pos)
/* CC1通道配置为输出时0：OC1输出关闭，OCx=0，OCx_EN=0*/
/* 1：OCx=OCxREF+极性选择，OCx_EN=1 */

#define	GPTIMx_CNT_CNT_Pos	0	/* 计数器值 (Counter) */
#define	GPTIMx_CNT_CNT_Msk	(0xffffU << GPTIMx_CNT_CNT_Pos)

#define	GPTIMx_PSC_PSC_Pos	0	/* 计数器时钟（CK_CNT）预分频值 (Counter Clock Prescaler) */
#define	GPTIMx_PSC_PSC_Msk	(0xffffU << GPTIMx_PSC_PSC_Pos)

#define	GPTIMx_ARR_ARR_Pos	0	/* 计数溢出时的自动重载值 (Auto-Reload Register) */
#define	GPTIMx_ARR_ARR_Msk	(0xffffU << GPTIMx_ARR_ARR_Pos)

#define	GPTIMx_CCR1_CCR1_Pos	0	/* 捕捉/比较通道1寄存器 (Capture/Compare channel 1 Register) */
#define	GPTIMx_CCR1_CCR1_Msk	(0xffffU << GPTIMx_CCR1_CCR1_Pos)

#define	GPTIMx_CCR2_CCR2_Pos	0	/* 捕捉/比较通道2寄存器 (Capture/Compare channel 2 Register) */
#define	GPTIMx_CCR2_CCR2_Msk	(0xffffU << GPTIMx_CCR2_CCR2_Pos)

#define	GPTIMx_CCR3_CCR3_Pos	0	/* 捕捉/比较通道3寄存器 (Capture/Compare channel 3 Register) */
#define	GPTIMx_CCR3_CCR3_Msk	(0xffffU << GPTIMx_CCR3_CCR3_Pos)

#define	GPTIMx_CCR4_CCR4_Pos	0	/* 捕捉/比较通道4寄存器 (Capture/Compare channel 4 Register) */
#define	GPTIMx_CCR4_CCR4_Msk	(0xffffU << GPTIMx_CCR4_CCR4_Pos)

#define	GPTIMx_DCR_DBL_Pos	8	/* DMA Burst长度 (DMA Burst Length) */
#define	GPTIMx_DCR_DBL_Msk	(0x1fU << GPTIMx_DCR_DBL_Pos)
#define	GPTIMx_DCR_DBL_LENG_1	(0x0U << GPTIMx_DCR_DBL_Pos)	/* 对GPTIM_DMAR寄存器的读写将触发burst DMA操作，burst长度为1~18 00000：长度=1 */
#define	GPTIMx_DCR_DBL_LENG_2	(0x1U << GPTIMx_DCR_DBL_Pos)	/* 00001：长度=2 */
#define	GPTIMx_DCR_DBL_LENG_3	(0x2U << GPTIMx_DCR_DBL_Pos)	/* 00010：长度=3 */
#define	GPTIMx_DCR_DBL_LENG_4	(0x3U << GPTIMx_DCR_DBL_Pos)	/* 00011：长度=4 */
#define	GPTIMx_DCR_DBL_LENG_5	(0x4U << GPTIMx_DCR_DBL_Pos)	/* 00100：长度=5 */
#define	GPTIMx_DCR_DBL_LENG_6	(0x5U << GPTIMx_DCR_DBL_Pos)	/* 00101：长度=6 */
#define	GPTIMx_DCR_DBL_LENG_7	(0x6U << GPTIMx_DCR_DBL_Pos)	/* 00110：长度=7 */
#define	GPTIMx_DCR_DBL_LENG_8	(0x7U << GPTIMx_DCR_DBL_Pos)	/* 00111：长度=8 */
#define	GPTIMx_DCR_DBL_LENG_9	(0x8U << GPTIMx_DCR_DBL_Pos)	/* 01000：长度=9 */
#define	GPTIMx_DCR_DBL_LENG_10	(0x9U << GPTIMx_DCR_DBL_Pos)	/* 01001：长度=10 */
#define	GPTIMx_DCR_DBL_LENG_11	(0xaU << GPTIMx_DCR_DBL_Pos)	/* 01010：长度=11 */
#define	GPTIMx_DCR_DBL_LENG_12	(0xbU << GPTIMx_DCR_DBL_Pos)	/* 01011：长度=12 */
#define	GPTIMx_DCR_DBL_LENG_13	(0xcU << GPTIMx_DCR_DBL_Pos)	/* 01100：长度=13 */
#define	GPTIMx_DCR_DBL_LENG_14	(0xdU << GPTIMx_DCR_DBL_Pos)	/* 01101：长度=14 */
#define	GPTIMx_DCR_DBL_LENG_15	(0xeU << GPTIMx_DCR_DBL_Pos)	/* 01110：长度=15 */
#define	GPTIMx_DCR_DBL_LENG_16	(0xfU << GPTIMx_DCR_DBL_Pos)	/* 01111：长度=16 */
#define	GPTIMx_DCR_DBL_LENG_17	(0x10U << GPTIMx_DCR_DBL_Pos)	/* 10000：长度=17 */
#define	GPTIMx_DCR_DBL_LENG_18	(0x11U << GPTIMx_DCR_DBL_Pos)	/* 10001：长度=18 */

#define	GPTIMx_DCR_DBA_Pos	0	/* DMA基地址，定义指向寄存器的偏移地址 (DMA Burst offset Address) */
#define	GPTIMx_DCR_DBA_Msk	(0x1fU << GPTIMx_DCR_DBA_Pos)
#define	GPTIMx_DCR_DBA_CR1	(0x0U << GPTIMx_DCR_DBA_Pos)	/* 00001：GPTIM_CR1 */
#define	GPTIMx_DCR_DBA_CR2	(0x1U << GPTIMx_DCR_DBA_Pos)	/* 00010：GPTIM_CR2 */
#define	GPTIMx_DCR_DBA_SMCR	(0x2U << GPTIMx_DCR_DBA_Pos)	/* 00011：GPTIM_SMCR */
#define	GPTIMx_DCR_DBA_DIER	(0x3U << GPTIMx_DCR_DBA_Pos)	/* 00100：GPTIM_DIER */
#define	GPTIMx_DCR_DBA_SR	(0x4U << GPTIMx_DCR_DBA_Pos)	/* 00101：GPTIM_SR */
#define	GPTIMx_DCR_DBA_EGR	(0x5U << GPTIMx_DCR_DBA_Pos)	/* 00110：GPTIM_EGR */
#define	GPTIMx_DCR_DBA_CCMR1	(0x6U << GPTIMx_DCR_DBA_Pos)	/* 00111：GPTIM_CCMR1 */
#define	GPTIMx_DCR_DBA_CCMR2	(0x7U << GPTIMx_DCR_DBA_Pos)	/* 01000：GPTIM_CCMR2 */
#define	GPTIMx_DCR_DBA_CCER	(0x8U << GPTIMx_DCR_DBA_Pos)	/* 01001：GPTIM_CCER */
#define	GPTIMx_DCR_DBA_CNT	(0x9U << GPTIMx_DCR_DBA_Pos)	/* 01010：GPTIM_CNT */
#define	GPTIMx_DCR_DBA_PSC	(0xaU << GPTIMx_DCR_DBA_Pos)	/* 01011：GPTIM_PSC */
#define	GPTIMx_DCR_DBA_ARR	(0xbU << GPTIMx_DCR_DBA_Pos)	/* 01100：GPTIM_ARR */
#define	GPTIMx_DCR_DBA_CCR1	(0xcU << GPTIMx_DCR_DBA_Pos)	/* 01101：GPTIM_CCR1 */
#define	GPTIMx_DCR_DBA_CCR2	(0xdU << GPTIMx_DCR_DBA_Pos)	/* 01110：GPTIM_CCR2 */
#define	GPTIMx_DCR_DBA_CCR3	(0xeU << GPTIMx_DCR_DBA_Pos)	/* 01111：GPTIM_CCR3 */
#define	GPTIMx_DCR_DBA_CCR4	(0xfU << GPTIMx_DCR_DBA_Pos)	/* 10000：GPTIM_CCR4 */
#define	GPTIMx_DCR_DBA_DCR	(0x10U << GPTIMx_DCR_DBA_Pos)	/* 10001：GPTIM_DCR */
#define	GPTIMx_DCR_DBA_DMAR	(0x11U << GPTIMx_DCR_DBA_Pos)	/* 10010: GPTIM_DMAR */
#define	GPTIMx_DCR_DBA_ITRSEL	(0x12U << GPTIMx_DCR_DBA_Pos)	/* 10011: GPTIM_ITRSEL */

#define	GPTIMx_DMAR_DMAR_Pos	0	/* DMA burst访问寄存器 (DMA Burst Access Register) */
#define	GPTIMx_DMAR_DMAR_Msk	(0xffffU << GPTIMx_DMAR_DMAR_Pos)

#define GPTIMx_ITRSEL_ITR3SEL_Pos         6       /* ITR输入信号选择 (Internal Trigger Source Selection) */
#define GPTIMx_ITRSEL_ITR3SEL_Msk        (0x3U << GPTIMx_ITRSEL_ITR3SEL_Pos)
#define GPTIM0_ITRSEL_ITR3SEL_COMP1_OUT (0x0U << GPTIMx_ITRSEL_ITR3SEL_Pos)
#define GPTIM0_ITRSEL_ITR3SEL_RC4M      (0x1U << GPTIMx_ITRSEL_ITR3SEL_Pos)
#define GPTIM0_ITRSEL_ITR3SEL_COMP2_OUT (0x2U << GPTIMx_ITRSEL_ITR3SEL_Pos)
#define GPTIM0_ITRSEL_ITR3SEL_LPTOUT1   (0x3U << GPTIMx_ITRSEL_ITR3SEL_Pos)
#define GPTIM1_ITRSEL_ITR3SEL_COMP1_OUT (0x0U << GPTIMx_ITRSEL_ITR3SEL_Pos)
#define GPTIM1_ITRSEL_ITR3SEL_RC4M      (0x1U << GPTIMx_ITRSEL_ITR3SEL_Pos)
#define GPTIM1_ITRSEL_ITR3SEL_COMP2_OUT (0x2U << GPTIMx_ITRSEL_ITR3SEL_Pos)
#define GPTIM1_ITRSEL_ITR3SEL_LPTOUT2   (0x3U << GPTIMx_ITRSEL_ITR3SEL_Pos)

#define GPTIMx_ITRSEL_ITR2SEL_Pos         4       /* ITR输入信号选择 (Internal Trigger Source Selection) */
#define GPTIMx_ITRSEL_ITR2SEL_Msk        (0x3U << GPTIMx_ITRSEL_ITR2SEL_Pos)
#define GPTIM0_ITRSEL_ITR2SEL_BSTIM_TRGO    (0x0U << GPTIMx_ITRSEL_ITR2SEL_Pos)
#define GPTIM0_ITRSEL_ITR2SEL_LPUART1_RX    (0x1U << GPTIMx_ITRSEL_ITR2SEL_Pos)
#define GPTIM0_ITRSEL_ITR2SEL_RCLP          (0x2U << GPTIMx_ITRSEL_ITR2SEL_Pos)
#define GPTIM0_ITRSEL_ITR2SEL_XTLF          (0x3U << GPTIMx_ITRSEL_ITR2SEL_Pos)
#define GPTIM1_ITRSEL_ITR2SEL_BSTIM_TRGO    (0x0U << GPTIMx_ITRSEL_ITR2SEL_Pos)
#define GPTIM1_ITRSEL_ITR2SEL_LSCLK         (0x1U << GPTIMx_ITRSEL_ITR2SEL_Pos)
#define GPTIM1_ITRSEL_ITR2SEL_RCLP          (0x2U << GPTIMx_ITRSEL_ITR2SEL_Pos)
#define GPTIM1_ITRSEL_ITR2SEL_XTLF          (0x3U << GPTIMx_ITRSEL_ITR2SEL_Pos)

#define GPTIMx_ITRSEL_ITR1SEL_Pos         2       /* ITR输入信号选择 (Internal Trigger Source Selection) */
#define GPTIMx_ITRSEL_ITR1SEL_Msk        (0x3U << GPTIMx_ITRSEL_ITR1SEL_Pos)
#define GPTIM0_ITRSEL_ITR1SEL_GPTIM1_TRGO   (0x0U << GPTIMx_ITRSEL_ITR1SEL_Pos)
#define GPTIM0_ITRSEL_ITR1SEL_XTHF          (0x1U << GPTIMx_ITRSEL_ITR1SEL_Pos)
#define GPTIM0_ITRSEL_ITR1SEL_RCHF          (0x2U << GPTIMx_ITRSEL_ITR1SEL_Pos)
#define GPTIM0_ITRSEL_ITR1SEL_LPUART0_RX    (0x3U << GPTIMx_ITRSEL_ITR1SEL_Pos)
#define GPTIM1_ITRSEL_ITR1SEL_GPTIM0_TRGO   (0x0U << GPTIMx_ITRSEL_ITR1SEL_Pos)
#define GPTIM1_ITRSEL_ITR1SEL_XTHF          (0x1U << GPTIMx_ITRSEL_ITR1SEL_Pos)
#define GPTIM1_ITRSEL_ITR1SEL_RCHF          (0x2U << GPTIMx_ITRSEL_ITR1SEL_Pos)
#define GPTIM1_ITRSEL_ITR1SEL_ADC_EOC       (0x3U << GPTIMx_ITRSEL_ITR1SEL_Pos)

#define GPTIMx_ITRSEL_ITR0SEL_Pos         0       /* ITR输入信号选择 (Internal Trigger Source Selection) */
#define GPTIMx_ITRSEL_ITR0SEL_Msk        (0x3U << GPTIMx_ITRSEL_ITR0SEL_Pos)
#define GPTIM1_ITRSEL_ITR0SEL_ATIM_TRGO     (0x0U << GPTIMx_ITRSEL_ITR0SEL_Pos)
#define GPTIM1_ITRSEL_ITR0SEL_UART0_RX      (0x1U << GPTIMx_ITRSEL_ITR0SEL_Pos)
#define GPTIM1_ITRSEL_ITR0SEL_UART1_RX      (0x2U << GPTIMx_ITRSEL_ITR0SEL_Pos)
#define GPTIM1_ITRSEL_ITR0SEL_UART4_RX      (0x3U << GPTIMx_ITRSEL_ITR0SEL_Pos)
#define GPTIM2_ITRSEL_ITR0SEL_ATIM_TRGO     (0x0U << GPTIMx_ITRSEL_ITR0SEL_Pos)
#define GPTIM2_ITRSEL_ITR0SEL_UART0_RX      (0x1U << GPTIMx_ITRSEL_ITR0SEL_Pos)
#define GPTIM2_ITRSEL_ITR0SEL_UART1_RX      (0x2U << GPTIMx_ITRSEL_ITR0SEL_Pos)
#define GPTIM2_ITRSEL_ITR0SEL_UART5_RX      (0x3U << GPTIMx_ITRSEL_ITR0SEL_Pos)

