wyp19960729/FM33L0XX-keil-GCC-/keil project/Drivers/fm33l0xx_gptim.h
//Macro_End

/* Exported functions --------------------------------------------------------*/ 
extern void GPTIMx_Deinit(GPTIM_Type* GPTIMx);

/* Dead time和数字滤波时钟频率分频寄存器（相对CK_INT的分频比）(Counter clocK Divider) 相关函数 */
extern void GPTIMx_CR1_CKD_Set(GPTIM_Type* GPTIMx, uint32_t SetValue);
extern uint32_t GPTIMx_CR1_CKD_Get(GPTIM_Type* GPTIMx);

/* Auto-reload预装载使能 (Auto-Reload Preload Enable) 相关函数 */
extern void GPTIMx_CR1_ARPE_Setable(GPTIM_Type* GPTIMx, FunState NewState);
extern FunState GPTIMx_CR1_ARPE_Getable(GPTIM_Type* GPTIMx);

/* 计数器对齐模式选择 (Counter Mode Selection) 相关函数 */
extern void GPTIMx_CR1_CMS_Set(GPTIM_Type* GPTIMx, uint32_t SetValue);
extern uint32_t GPTIMx_CR1_CMS_Get(GPTIM_Type* GPTIMx);

/* 计数方向寄存器 (counter Direction) 相关函数 */
extern void GPTIMx_CR1_DIR_Set(GPTIM_Type* GPTIMx, uint32_t SetValue);
extern uint32_t GPTIMx_CR1_DIR_Get(GPTIM_Type* GPTIMx);

/* 单脉冲输出模式 (One Pulse Mode) 相关函数 */
extern void GPTIMx_CR1_OPM_Setable(GPTIM_Type* GPTIMx, FunState NewState);
extern FunState GPTIMx_CR1_OPM_Getable(GPTIM_Type* GPTIMx);

/* 更新请求选择 (Update Request Selection) 相关函数 */
extern void GPTIMx_CR1_URS_Setable(GPTIM_Type* GPTIMx, FunState NewState);
extern FunState GPTIMx_CR1_URS_Getable(GPTIM_Type* GPTIMx);

/* 禁止update (Update Disable) 相关函数 */
extern void GPTIMx_CR1_UDIS_Setable(GPTIM_Type* GPTIMx, FunState NewState);
extern FunState GPTIMx_CR1_UDIS_Getable(GPTIM_Type* GPTIMx);

/* 计数器使能 (Counter Enable) 相关函数 */
extern void GPTIMx_CR1_CEN_Setable(GPTIM_Type* GPTIMx, FunState NewState);
extern FunState GPTIMx_CR1_CEN_Getable(GPTIM_Type* GPTIMx);

/* 通道1输入源选择 (Timer Input 1 Selection) 相关函数 */
extern void GPTIMx_CR2_TI1S_Set(GPTIM_Type* GPTIMx, uint32_t SetValue);
extern uint32_t GPTIMx_CR2_TI1S_Get(GPTIM_Type* GPTIMx);

/* 主机模式选择，用于配置主机模式下向从机发送的同步触发信号（TRGO）源 (Master Mode Selection) 相关函数 */
extern void GPTIMx_CR2_MMS_Set(GPTIM_Type* GPTIMx, uint32_t SetValue);
extern uint32_t GPTIMx_CR2_MMS_Get(GPTIM_Type* GPTIMx);

/* 捕捉/比较 DMA选择 (Capture/Compare DMA Selection) 相关函数 */
extern void GPTIMx_CR2_CCDS_Set(GPTIM_Type* GPTIMx, uint32_t SetValue);
extern uint32_t GPTIMx_CR2_CCDS_Get(GPTIM_Type* GPTIMx);

/* 外部触发信号极性配置 (External Trigger Polarity) 相关函数 */
extern void GPTIMx_SMCR_ETP_Set(GPTIM_Type* GPTIMx, uint32_t SetValue);
extern uint32_t GPTIMx_SMCR_ETP_Get(GPTIM_Type* GPTIMx);

/* 外部时钟使能 (External Clock Enable) 相关函数 */
extern void GPTIMx_SMCR_ECE_Setable(GPTIM_Type* GPTIMx, FunState NewState);
extern FunState GPTIMx_SMCR_ECE_Getable(GPTIM_Type* GPTIMx);

/* 外部触发信号预分频寄存器 (External Trigger Prescaler)
外部触发信号ETRP的频率最多只能是GPTIM工作时钟的1/4，当输入信号频率较高时，可以使用预分频 相关函数 */
extern void GPTIMx_SMCR_ETPS_Set(GPTIM_Type* GPTIMx, uint32_t SetValue);
extern uint32_t GPTIMx_SMCR_ETPS_Get(GPTIM_Type* GPTIMx);

/* 外部触发信号滤波时钟和长度选择 (External Trigger Filter) 相关函数 */
extern void GPTIMx_SMCR_ETF_Set(GPTIM_Type* GPTIMx, uint32_t SetValue);
extern uint32_t GPTIMx_SMCR_ETF_Get(GPTIM_Type* GPTIMx);

/* 主/从模式 (Master Slave Mode) 相关函数 */
extern void GPTIMx_SMCR_MSM_Set(GPTIM_Type* GPTIMx, uint32_t SetValue);
extern uint32_t GPTIMx_SMCR_MSM_Get(GPTIM_Type* GPTIMx);

/* 触发选择，用于选择同步计数器的触发源 (Trigger Source) 相关函数 */
extern void GPTIMx_SMCR_TS_Set(GPTIM_Type* GPTIMx, uint32_t SetValue);
extern uint32_t GPTIMx_SMCR_TS_Get(GPTIM_Type* GPTIMx);

/* 从机模式选择 (Slave Mode Selection) 相关函数 */
extern void GPTIMx_SMCR_SMS_Set(GPTIM_Type* GPTIMx, uint32_t SetValue);
extern uint32_t GPTIMx_SMCR_SMS_Get(GPTIM_Type* GPTIMx);

/* 捕捉比较通道4的DMA模式配置 (CC4 Burst Enable) 相关函数 */
extern void GPTIMx_DIER_CC4BURSTEN_Set(GPTIM_Type* GPTIMx, uint32_t SetValue);
extern uint32_t GPTIMx_DIER_CC4BURSTEN_Get(GPTIM_Type* GPTIMx);

/* 捕捉比较通道3的DMA模式配置 (CC3 Burst Enable) 相关函数 */
extern void GPTIMx_DIER_CC3BURSTEN_Set(GPTIM_Type* GPTIMx, uint32_t SetValue);
extern uint32_t GPTIMx_DIER_CC3BURSTEN_Get(GPTIM_Type* GPTIMx);

/* 捕捉比较通道2的DMA模式配置 (CC2 Burst Enable) 相关函数 */
extern void GPTIMx_DIER_CC2BURSTEN_Set(GPTIM_Type* GPTIMx, uint32_t SetValue);
extern uint32_t GPTIMx_DIER_CC2BURSTEN_Get(GPTIM_Type* GPTIMx);

/* 捕捉比较通道1的DMA模式配置 (CC1 Burst Enable) 相关函数 */
extern void GPTIMx_DIER_CC1BURSTEN_Set(GPTIM_Type* GPTIMx, uint32_t SetValue);
extern uint32_t GPTIMx_DIER_CC1BURSTEN_Get(GPTIM_Type* GPTIMx);

/* 外部触发DMA请求使能 (Triggered DMA Enable) 相关函数 */
extern void GPTIMx_DIER_TDE_Setable(GPTIM_Type* GPTIMx, FunState NewState);
extern FunState GPTIMx_DIER_TDE_Getable(GPTIM_Type* GPTIMx);

/* 捕捉比较通道4的DMA请求使能 (CC4 DMA Enable) 相关函数 */
extern void GPTIMx_DIER_CC4DE_Setable(GPTIM_Type* GPTIMx, FunState NewState);
extern FunState GPTIMx_DIER_CC4DE_Getable(GPTIM_Type* GPTIMx);

/* 捕捉比较通道3的DMA请求使能 (CC3 DMA Enable) 相关函数 */
extern void GPTIMx_DIER_CC3DE_Setable(GPTIM_Type* GPTIMx, FunState NewState);
extern FunState GPTIMx_DIER_CC3DE_Getable(GPTIM_Type* GPTIMx);

/* 捕捉比较通道2的DMA请求使能 (CC2 DMA Enable) 相关函数 */
extern void GPTIMx_DIER_CC2DE_Setable(GPTIM_Type* GPTIMx, FunState NewState);
extern FunState GPTIMx_DIER_CC2DE_Getable(GPTIM_Type* GPTIMx);

/* 捕捉比较通道1的DMA请求使能 (CC1 DMA Enable) 相关函数 */
extern void GPTIMx_DIER_CC1DE_Setable(GPTIM_Type* GPTIMx, FunState NewState);
extern FunState GPTIMx_DIER_CC1DE_Getable(GPTIM_Type* GPTIMx);

/* Update Event DMA请求使能 (Update event DMA Enable) 相关函数 */
extern void GPTIMx_DIER_UDE_Setable(GPTIM_Type* GPTIMx, FunState NewState);
extern FunState GPTIMx_DIER_UDE_Getable(GPTIM_Type* GPTIMx);

/* 触发事件中断使能 (Trigger event Interrupt Enable) 相关函数 */
extern void GPTIMx_DIER_TIE_Setable(GPTIM_Type* GPTIMx, FunState NewState);
extern FunState GPTIMx_DIER_TIE_Getable(GPTIM_Type* GPTIMx);

/* 捕捉/比较通道4中断使能 (CC4 Interrupt Enable) 相关函数 */
extern void GPTIMx_DIER_CC4IE_Setable(GPTIM_Type* GPTIMx, FunState NewState);
extern FunState GPTIMx_DIER_CC4IE_Getable(GPTIM_Type* GPTIMx);

/* 捕捉/比较通道3中断使能 (CC3 Interrupt Enable) 相关函数 */
extern void GPTIMx_DIER_CC3IE_Setable(GPTIM_Type* GPTIMx, FunState NewState);
extern FunState GPTIMx_DIER_CC3IE_Getable(GPTIM_Type* GPTIMx);

/* 捕捉/比较通道2中断使能 (CC2 Interrupt Enable) 相关函数 */
extern void GPTIMx_DIER_CC2IE_Setable(GPTIM_Type* GPTIMx, FunState NewState);
extern FunState GPTIMx_DIER_CC2IE_Getable(GPTIM_Type* GPTIMx);

/* 捕捉/比较通道1中断使能 (CC1 Interrupt Enable) 相关函数 */
extern void GPTIMx_DIER_CC1IE_Setable(GPTIM_Type* GPTIMx, FunState NewState);
extern FunState GPTIMx_DIER_CC1IE_Getable(GPTIM_Type* GPTIMx);

/* Update事件中断使能 (Update event Interrupt Enable) 相关函数 */
extern void GPTIMx_DIER_UIE_Setable(GPTIM_Type* GPTIMx, FunState NewState);
extern FunState GPTIMx_DIER_UIE_Getable(GPTIM_Type* GPTIMx);

