wyp19960729/FM33L0XX-keil-GCC-/keil project/Drivers/fm33l0xx_gptim.h
/* 捕捉/比较通道4的Overcapture中断 (Over-Capture Interrupt Flag for CC4) 相关函数 */
extern void GPTIMx_ISR_CC4OF_Clr(GPTIM_Type* GPTIMx);
extern FlagStatus GPTIMx_ISR_CC4OF_Chk(GPTIM_Type* GPTIMx);

/* 捕捉/比较通道3的Overcapture中断 (Over-Capture Interrupt Flag for CC3) 相关函数 */
extern void GPTIMx_ISR_CC3OF_Clr(GPTIM_Type* GPTIMx);
extern FlagStatus GPTIMx_ISR_CC3OF_Chk(GPTIM_Type* GPTIMx);

/* 捕捉/比较通道2的Overcapture中断 (Over-Capture Interrupt Flag for CC2) 相关函数 */
extern void GPTIMx_ISR_CC2OF_Clr(GPTIM_Type* GPTIMx);
extern FlagStatus GPTIMx_ISR_CC2OF_Chk(GPTIM_Type* GPTIMx);

/* 捕捉/比较通道1的Overcapture中断 (Over-Capture Interrupt Flag for CC1) 相关函数 */
extern void GPTIMx_ISR_CC1OF_Clr(GPTIM_Type* GPTIMx);
extern FlagStatus GPTIMx_ISR_CC1OF_Chk(GPTIM_Type* GPTIMx);

/* 触发事件中断标志 相关函数 */
extern void GPTIMx_ISR_TIF_Clr(GPTIM_Type* GPTIMx);
extern FlagStatus GPTIMx_ISR_TIF_Chk(GPTIM_Type* GPTIMx);

/* 捕捉/比较通道4中断标志 (CC4 Interrupt Flag) 相关函数 */
extern void GPTIMx_ISR_CC4IF_Clr(GPTIM_Type* GPTIMx);
extern FlagStatus GPTIMx_ISR_CC4IF_Chk(GPTIM_Type* GPTIMx);

/* 捕捉/比较通道3中断标志 (CC3 Interrupt Flag) 相关函数 */
extern void GPTIMx_ISR_CC3IF_Clr(GPTIM_Type* GPTIMx);
extern FlagStatus GPTIMx_ISR_CC3IF_Chk(GPTIM_Type* GPTIMx);

/* 捕捉/比较通道2中断标志 (CC2 Interrupt Flag) 相关函数 */
extern void GPTIMx_ISR_CC2IF_Clr(GPTIM_Type* GPTIMx);
extern FlagStatus GPTIMx_ISR_CC2IF_Chk(GPTIM_Type* GPTIMx);

/* 捕捉/比较通道1中断标志 (CC1 Interrupt Flag) 相关函数 */
extern void GPTIMx_ISR_CC1IF_Clr(GPTIM_Type* GPTIMx);
extern FlagStatus GPTIMx_ISR_CC1IF_Chk(GPTIM_Type* GPTIMx);

/* Update事件中断标志，硬件置位，软件写1清零。(Update event Interrupt Flag) 相关函数 */
extern void GPTIMx_ISR_UIF_Clr(GPTIM_Type* GPTIMx);
extern FlagStatus GPTIMx_ISR_UIF_Chk(GPTIM_Type* GPTIMx);

/* 软件触发，软件置位此寄存器产生触发事件，硬件自动清零 (Trigger Generate) 相关函数 */
extern void GPTIMx_EGR_TG_Setable(GPTIM_Type* GPTIMx, FunState NewState);

/* 捕捉/比较通道4软件触发 (CC4 Generate) 相关函数 */
extern void GPTIMx_EGR_CC4G_Setable(GPTIM_Type* GPTIMx, FunState NewState);

/* 捕捉/比较通道3软件触发 (CC3 Generate) 相关函数 */
extern void GPTIMx_EGR_CC3G_Setable(GPTIM_Type* GPTIMx, FunState NewState);

/* 捕捉/比较通道2软件触发 (CC2 Generate) 相关函数 */
extern void GPTIMx_EGR_CC2G_Setable(GPTIM_Type* GPTIMx, FunState NewState);

/* 捕捉/比较通道1软件触发 (CC1 Generate) 相关函数 */
extern void GPTIMx_EGR_CC1G_Setable(GPTIM_Type* GPTIMx, FunState NewState);

/* 软件Update事件，软件置位此寄存器产生Update事件，硬件自动清零 (User Generate) 相关函数 */
extern void GPTIMx_EGR_UG_Setable(GPTIM_Type* GPTIMx, FunState NewState);

/* 输出比较2清零使能 (OC2 Clear Enable) 相关函数 */
extern void GPTIMx_CCMR1_OC2CE_Setable(GPTIM_Type* GPTIMx, FunState NewState);
extern FunState GPTIMx_CCMR1_OC2CE_Getable(GPTIM_Type* GPTIMx);

/* 输出比较2模式配置，此寄存器定义OC2REF信号的行为 (OC2 Mode) 相关函数 */
extern void GPTIMx_CCMR1_OC2M_Set(GPTIM_Type* GPTIMx, uint32_t SetValue);
extern uint32_t GPTIMx_CCMR1_OC2M_Get(GPTIM_Type* GPTIMx);

/* 输出比较2预装载使能 (OC2 Preload Enable) 相关函数 */
extern void GPTIMx_CCMR1_OC2PE_Setable(GPTIM_Type* GPTIMx, FunState NewState);
extern FunState GPTIMx_CCMR1_OC2PE_Getable(GPTIM_Type* GPTIMx);

/* 输出比较2快速使能 (OC2 Fast Enable) 相关函数 */
extern void GPTIMx_CCMR1_OC2FE_Setable(GPTIM_Type* GPTIMx, FunState NewState);
extern FunState GPTIMx_CCMR1_OC2FE_Getable(GPTIM_Type* GPTIMx);

/* 捕捉/比较2通道选择 (CC2 channel Selection) 相关函数 */
extern void GPTIMx_CCMR1_CC2S_Set(GPTIM_Type* GPTIMx, uint32_t SetValue);
extern uint32_t GPTIMx_CCMR1_CC2S_Get(GPTIM_Type* GPTIMx);

/* 输出比较1清零使能 (OC2 Clear Enable) 相关函数 */
extern void GPTIMx_CCMR1_OC1CE_Setable(GPTIM_Type* GPTIMx, FunState NewState);
extern FunState GPTIMx_CCMR1_OC1CE_Getable(GPTIM_Type* GPTIMx);

/* 输出比较1模式配置，此寄存器定义OC1REF信号的行为 (OC1 Mode) 相关函数 */
extern void GPTIMx_CCMR1_OC1M_Set(GPTIM_Type* GPTIMx, uint32_t SetValue);
extern uint32_t GPTIMx_CCMR1_OC1M_Get(GPTIM_Type* GPTIMx);

/* 输出比较1预装载使能 (OC1 Preload Enable) 相关函数 */
extern void GPTIMx_CCMR1_OC1PE_Setable(GPTIM_Type* GPTIMx, FunState NewState);
extern FunState GPTIMx_CCMR1_OC1PE_Getable(GPTIM_Type* GPTIMx);

/* 输出比较1快速使能 (OC1 Fast Enable) 相关函数 */
extern void GPTIMx_CCMR1_OC1FE_Setable(GPTIM_Type* GPTIMx, FunState NewState);
extern FunState GPTIMx_CCMR1_OC1FE_Getable(GPTIM_Type* GPTIMx);

/* 捕捉/比较1通道选择 (CC1 channel Selection) 相关函数 */
extern void GPTIMx_CCMR1_CC1S_Set(GPTIM_Type* GPTIMx, uint32_t SetValue);
extern uint32_t GPTIMx_CCMR1_CC1S_Get(GPTIM_Type* GPTIMx);

/* 输入捕捉2滤波 (IC2 Filter) 相关函数 */
extern void GPTIMx_CCMR1_IC2F_Set(GPTIM_Type* GPTIMx, uint32_t SetValue);
extern uint32_t GPTIMx_CCMR1_IC2F_Get(GPTIM_Type* GPTIMx);

/* 输入捕捉2预分频 (IC2 Prescaler) 相关函数 */
extern void GPTIMx_CCMR1_IC2PSC_Set(GPTIM_Type* GPTIMx, uint32_t SetValue);
extern uint32_t GPTIMx_CCMR1_IC2PSC_Get(GPTIM_Type* GPTIMx);

/* 输入捕捉1滤波 (IC1 Filter) 相关函数 */
extern void GPTIMx_CCMR1_IC1F_Set(GPTIM_Type* GPTIMx, uint32_t SetValue);
extern uint32_t GPTIMx_CCMR1_IC1F_Get(GPTIM_Type* GPTIMx);

/* 输入捕捉1预分频 (IC1 Prescaler) 相关函数 */
extern void GPTIMx_CCMR1_IC1PSC_Set(GPTIM_Type* GPTIMx, uint32_t SetValue);
extern uint32_t GPTIMx_CCMR1_IC1PSC_Get(GPTIM_Type* GPTIMx);

/* 输出比较4清零使能 (OC4 Clear Enable) 相关函数 */
extern void GPTIMx_CCMR2_OC4CE_Setable(GPTIM_Type* GPTIMx, FunState NewState);
extern FunState GPTIMx_CCMR2_OC4CE_Getable(GPTIM_Type* GPTIMx);

/* 输出比较4模式配置，此寄存器定义OC4REF信号的行为 (OC4 Mode) 相关函数 */
extern void GPTIMx_CCMR2_OC4M_Set(GPTIM_Type* GPTIMx, uint32_t SetValue);
extern uint32_t GPTIMx_CCMR2_OC4M_Get(GPTIM_Type* GPTIMx);

/* 输出比较4预装载使能 (OC4 Preload Enable) 相关函数 */
extern void GPTIMx_CCMR2_OC4PE_Setable(GPTIM_Type* GPTIMx, FunState NewState);
extern FunState GPTIMx_CCMR2_OC4PE_Getable(GPTIM_Type* GPTIMx);

/* 输出比较4快速使能 (OC4 Fast Enable) 相关函数 */
extern void GPTIMx_CCMR2_OC4FE_Setable(GPTIM_Type* GPTIMx, FunState NewState);
extern FunState GPTIMx_CCMR2_OC4FE_Getable(GPTIM_Type* GPTIMx);

/* 捕捉/比较4通道选择 (CC4 channel Selection) 相关函数 */
extern void GPTIMx_CCMR2_CC4S_Set(GPTIM_Type* GPTIMx, uint32_t SetValue);
extern uint32_t GPTIMx_CCMR2_CC4S_Get(GPTIM_Type* GPTIMx);

/* 输出比较3清零使能 (OC3 Clear Enable) 相关函数 */
extern void GPTIMx_CCMR2_OC3CE_Setable(GPTIM_Type* GPTIMx, FunState NewState);
extern FunState GPTIMx_CCMR2_OC3CE_Getable(GPTIM_Type* GPTIMx);

/* 输出比较3模式配置，此寄存器定义OC3REF信号的行为 (OC3 Mode) 相关函数 */
extern void GPTIMx_CCMR2_OC3M_Set(GPTIM_Type* GPTIMx, uint32_t SetValue);
extern uint32_t GPTIMx_CCMR2_OC3M_Get(GPTIM_Type* GPTIMx);

/* 输出比较3预装载使能 (OC3 Preload Enable) 相关函数 */
extern void GPTIMx_CCMR2_OC3PE_Setable(GPTIM_Type* GPTIMx, FunState NewState);
extern FunState GPTIMx_CCMR2_OC3PE_Getable(GPTIM_Type* GPTIMx);

/* 输出比较3快速使能 (OC3 Fast Enable) 相关函数 */
extern void GPTIMx_CCMR2_OC3FE_Setable(GPTIM_Type* GPTIMx, FunState NewState);
extern FunState GPTIMx_CCMR2_OC3FE_Getable(GPTIM_Type* GPTIMx);

/* 捕捉/比较3通道选择 (CC3 channel Selection) 相关函数 */
extern void GPTIMx_CCMR2_CC3S_Set(GPTIM_Type* GPTIMx, uint32_t SetValue);
extern uint32_t GPTIMx_CCMR2_CC3S_Get(GPTIM_Type* GPTIMx);

/* 输入捕捉4滤波 (IC4 Filter) 相关函数 */
extern void GPTIMx_CCMR2_IC4F_Set(GPTIM_Type* GPTIMx, uint32_t SetValue);
extern uint32_t GPTIMx_CCMR2_IC4F_Get(GPTIM_Type* GPTIMx);

/* 输入捕捉4预分频 (IC4 Prescaler) 相关函数 */
extern void GPTIMx_CCMR2_IC4PSC_Set(GPTIM_Type* GPTIMx, uint32_t SetValue);
extern uint32_t GPTIMx_CCMR2_IC4PSC_Get(GPTIM_Type* GPTIMx);

/* 输入捕捉3滤波 (IC3 Filter) 相关函数 */
extern void GPTIMx_CCMR2_IC3F_Set(GPTIM_Type* GPTIMx, uint32_t SetValue);
extern uint32_t GPTIMx_CCMR2_IC3F_Get(GPTIM_Type* GPTIMx);

/* 输入捕捉3预分频 (IC3 Prescaler) 相关函数 */
extern void GPTIMx_CCMR2_IC3PSC_Set(GPTIM_Type* GPTIMx, uint32_t SetValue);
extern uint32_t GPTIMx_CCMR2_IC3PSC_Get(GPTIM_Type* GPTIMx);

/* 捕捉/比较4输出极性 (CC4 Polarity) 相关函数 */
extern void GPTIMx_CCER_CC4P_Set(GPTIM_Type* GPTIMx, uint32_t SetValue);
extern uint32_t GPTIMx_CCER_CC4P_Get(GPTIM_Type* GPTIMx);

/* 捕捉/比较4输出使能 (CC4 output Enable) 相关函数 */
extern void GPTIMx_CCER_CC4E_Setable(GPTIM_Type* GPTIMx, FunState NewState);
extern FunState GPTIMx_CCER_CC4E_Getable(GPTIM_Type* GPTIMx);

/* 捕捉/比较3输出极性 (CC3 Polarity) 相关函数 */
extern void GPTIMx_CCER_CC3P_Set(GPTIM_Type* GPTIMx, uint32_t SetValue);
extern uint32_t GPTIMx_CCER_CC3P_Get(GPTIM_Type* GPTIMx);

/* 捕捉/比较3输出使能 (CC3 output Enable) 相关函数 */
extern void GPTIMx_CCER_CC3E_Setable(GPTIM_Type* GPTIMx, FunState NewState);
extern FunState GPTIMx_CCER_CC3E_Getable(GPTIM_Type* GPTIMx);

/* 捕捉/比较2输出极性 (CC2 Polarity) 相关函数 */
extern void GPTIMx_CCER_CC2P_Set(GPTIM_Type* GPTIMx, uint32_t SetValue);
extern uint32_t GPTIMx_CCER_CC2P_Get(GPTIM_Type* GPTIMx);

