wyp19960729/FM33L0XX-keil-GCC-/keil project/Drivers/fm33l0xx_gptim.h
/* 捕捉/比较2输出使能 (CC2 output Enable) 相关函数 */
extern void GPTIMx_CCER_CC2E_Setable(GPTIM_Type* GPTIMx, FunState NewState);
extern FunState GPTIMx_CCER_CC2E_Getable(GPTIM_Type* GPTIMx);

/* 捕捉/比较1输出极性 (CC1 Polarity) 相关函数 */
extern void GPTIMx_CCER_CC1P_Set(GPTIM_Type* GPTIMx, uint32_t SetValue);
extern uint32_t GPTIMx_CCER_CC1P_Get(GPTIM_Type* GPTIMx);

/* 捕捉/比较1输出使能 (CC1 output Enable) 相关函数 */
extern void GPTIMx_CCER_CC1E_Setable(GPTIM_Type* GPTIMx, FunState NewState);
extern FunState GPTIMx_CCER_CC1E_Getable(GPTIM_Type* GPTIMx);

/* 计数器值 (Counter) 相关函数 */
extern void GPTIMx_CNT_Write(GPTIM_Type* GPTIMx, uint32_t SetValue);
extern uint32_t GPTIMx_CNT_Read(GPTIM_Type* GPTIMx);

/* 计数器时钟（CK_CNT）预分频值 (Counter Clock Prescaler) 相关函数 */
extern void GPTIMx_PSC_Write(GPTIM_Type* GPTIMx, uint32_t SetValue);
extern uint32_t GPTIMx_PSC_Read(GPTIM_Type* GPTIMx);

/* 计数溢出时的自动重载值 (Auto-Reload Register) 相关函数 */
extern void GPTIMx_ARR_Write(GPTIM_Type* GPTIMx, uint32_t SetValue);
extern uint32_t GPTIMx_ARR_Read(GPTIM_Type* GPTIMx);

/* 捕捉/比较通道1寄存器 (Capture/Compare channel 1 Register) 相关函数 */
extern void GPTIMx_CCR1_Write(GPTIM_Type* GPTIMx, uint32_t SetValue);
extern uint32_t GPTIMx_CCR1_Read(GPTIM_Type* GPTIMx);

/* 捕捉/比较通道2寄存器 (Capture/Compare channel 2 Register) 相关函数 */
extern void GPTIMx_CCR2_Write(GPTIM_Type* GPTIMx, uint32_t SetValue);
extern uint32_t GPTIMx_CCR2_Read(GPTIM_Type* GPTIMx);

/* 捕捉/比较通道3寄存器 (Capture/Compare channel 3 Register) 相关函数 */
extern void GPTIMx_CCR3_Write(GPTIM_Type* GPTIMx, uint32_t SetValue);
extern uint32_t GPTIMx_CCR3_Read(GPTIM_Type* GPTIMx);

/* 捕捉/比较通道4寄存器 (Capture/Compare channel 4 Register) 相关函数 */
extern void GPTIMx_CCR4_Write(GPTIM_Type* GPTIMx, uint32_t SetValue);
extern uint32_t GPTIMx_CCR4_Read(GPTIM_Type* GPTIMx);

/* DMA Burst长度 (DMA Burst Length) 相关函数 */
extern void GPTIMx_DCR_DBL_Set(GPTIM_Type* GPTIMx, uint32_t SetValue);
extern uint32_t GPTIMx_DCR_DBL_Get(GPTIM_Type* GPTIMx);

/* DMA基地址，定义指向寄存器的偏移地址 (DMA Burst offset Address) 相关函数 */
extern void GPTIMx_DCR_DBA_Set(GPTIM_Type* GPTIMx, uint32_t SetValue);
extern uint32_t GPTIMx_DCR_DBA_Get(GPTIM_Type* GPTIMx);

/* DMA burst访问寄存器 (DMA Burst Access Register) 相关函数 */
extern void GPTIMx_DMAR_Write(GPTIM_Type* GPTIMx, uint32_t SetValue);
extern uint32_t GPTIMx_DMAR_Read(GPTIM_Type* GPTIMx);

/* ITR输入信号选择 (Internal Trigger Source Selection) 相关函数 */
extern void GPTIMx_ITRSEL_ITR3SEL_Set(GPTIM_Type* GPTIMx, uint32_t SetValue);
extern uint32_t GPTIMx_ITRSEL_ITR3SEL_Get(GPTIM_Type* GPTIMx);

/* ITR输入信号选择 (Internal Trigger Source Selection) 相关函数 */
extern void GPTIMx_ITRSEL_ITR2SEL_Set(GPTIM_Type* GPTIMx, uint32_t SetValue);
extern uint32_t GPTIMx_ITRSEL_ITR2SEL_Get(GPTIM_Type* GPTIMx);

/* ITR输入信号选择 (Internal Trigger Source Selection) 相关函数 */
extern void GPTIMx_ITRSEL_ITR1SEL_Set(GPTIM_Type* GPTIMx, uint32_t SetValue);
extern uint32_t GPTIMx_ITRSEL_ITR1SEL_Get(GPTIM_Type* GPTIMx);

/* ITR输入信号选择 (Internal Trigger Source Selection) 相关函数 */
extern void GPTIMx_ITRSEL_ITR0SEL_Set(GPTIM_Type* GPTIMx, uint32_t SetValue);
extern uint32_t GPTIMx_ITRSEL_ITR0SEL_Get(GPTIM_Type* GPTIMx);

extern void GPTIMx_TimeBaseInit(GPTIM_Type* GPTIMx,TIM_TimeBaseInitTypeDef* TIM_TimeBaseInitStruct);
extern void GPTIMx_ClearITPendingBit(GPTIM_Type* GPTIMx,uint32_t TIM_IT);
extern void GPTIMx_ITConfig(GPTIM_Type* GPTIMx,uint32_t TIM_IT, FunState NewState);
extern ITStatus GPTIMx_GetITStatus(GPTIM_Type* GPTIMx,uint32_t TIM_IT);
extern void GPTIMx_Cmd(GPTIM_Type* GPTIMx,FunState NewState);
extern void GPTIMx_ICInit(GPTIM_Type* GPTIMx, TIM_ICInitTypeDef* TIM_ICInitStruct);
#ifdef __cplusplus
}
#endif

#endif /* __FM33L0XX_GPTIM_H */



/************************ (C) COPYRIGHT FMSHelectronics *****END OF FILE****/
